TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_rtc_common.h
#ifdef __MSP_HAS_RTC_A__
/*! @enum DL_RTC_COMMON_TIME_STAMP_EVENT_CAPTURE */
typedef enum {
    /*! Time stamp holds RTC capture at first occurrence of time stamp event */
    DL_RTC_COMMON_TIME_STAMP_EVENT_CAPTURE_FIRST = RTC_TSCTL_TSCAPTURE_FIRST,
    /*! Time stamp holds RTC capture at last occurrence of time stamp event */
    DL_RTC_COMMON_TIME_STAMP_EVENT_CAPTURE_LAST = RTC_TSCTL_TSCAPTURE_LAST,
} DL_RTC_COMMON_TIME_STAMP_EVENT_CAPTURE;
#endif

/* clang-format on */

/**
 * @brief   Alarm struct to use in DL_RTC_Common_setCalendarAlarm
 *
 * @note    All struct values must be in the same format (Binary OR BCD).
 *          RTC Common format is set during initialization.
 */
typedef struct {
    /** The minute to set the Alarm time to. Valid values are 0-59 in Binary
     * format OR 0x0-0x59 in BCD format. */
    uint8_t minutes;
    /** The hour to set the Alarm time to. Valid values are 0-23 in Binary
     * format OR 0x0-0x23 in BCD format. */
    uint8_t hours;
    /** The day of the week to set the Alarm time to. Valid values are 0-6
     * in Binary format OR 0x0-0x6 in BCD format. */
    uint8_t dayOfWeek;
    /** The day of the month to set the Alarm time to. Valid values are 1-31
     * in Binary format OR 0x1-0x31 in BCD format. */
    uint8_t dayOfMonth;
} DL_RTC_Common_CalendarAlarm;

/**
 * @brief   Calendar struct to use in DL_RTC_Common_initCalendar()
 *
 * @note    All struct values must be in the same format (Binary OR BCD).
 *          RTC Common format is set during initialization.
 */
typedef struct {
    /** The second to set the Calendar time to. Valid values are 0-59 in Binary
     * format OR 0x0-0x59 in BCD format. */
    uint8_t seconds;
    /** The minute to set the Calendar time to. Valid values are 0-59 in Binary
     * format OR 0x0-0x59 in BCD format. */
    uint8_t minutes;
    /** The hour to set the Calendar time to. Valid values are 0-23 in Binary
     * format OR 0x0-0x23 in BCD format. */
    uint8_t hours;
    /** The day of the week to set the Calendar time to. Valid values are 0-6
     * in Binary format OR 0x0-0x6 in BCD format. */
    uint8_t dayOfWeek;
    /** The day of the month to set the Calendar time to. Valid values are 1-31
     * in Binary format OR 0x1-0x31 in BCD format. */
    uint8_t dayOfMonth;
    /** The month to set the Calendar time to. Valid values are 1-12 in Binary
     * format OR 0x1-0x12 in BCD format. */
    uint8_t month;
    /** The year to set the Calendar time to. Valid values are 0-4095 in Binary
     * format OR 0x0-0x4095 in BCD format. */
    uint16_t year;
} DL_RTC_Common_Calendar;

/**
 *  @brief Returns if LFCLK is selected as clock source
 *
 * If the LFCLK is enabled, the RTC Common module will select it as the clock source.
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return true  If LFCLK is selected as the clock source
 *  @return false If LFCLK is not selected as the clock source
 */
__STATIC_INLINE bool DL_RTC_Common_isClockSourceLFCLK(
    const RTC_Regs *rtc_common)
{
    return ((rtc_common->CLKSEL & RTC_CLKSEL_LFCLK_SEL_MASK) ==
            RTC_CLKSEL_LFCLK_SEL_MASK);
}

/**
 *  @brief      Enables the supply of the 32kHz clock to the RTC Common. It will not
 *              power up the 32kHz crystal oscillator. This needs to be done
 *              in the Clock System Module.
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_enableClockControl(RTC_Regs *rtc_common)
{
    rtc_common->CLKCTL = RTC_CLKCTL_MODCLKEN_ENABLE;
}

/**
 *  @brief      Disables the supply of the 32kHz clock to the RTC Common.
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_disableClockControl(RTC_Regs *rtc_common)
{
    rtc_common->CLKCTL = RTC_CLKCTL_MODCLKEN_DISABLE;
}

/**
 * @brief Enables the Peripheral Write Enable (PWREN) register for the RTC
 *
 *  Before any peripheral registers can be configured by software, the
 *  peripheral itself must be enabled by writing the ENABLE bit together with
 *  the appropriate KEY value to the peripheral's PWREN register.
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_enablePower(RTC_Regs *rtc_common)
{
    rtc_common->GPRCM.PWREN =
        (RTC_PWREN_KEY_UNLOCK_W | RTC_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Disables the Peripheral Write Enable (PWREN) register for the RTC
 *
 *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
 *  accessible for read/write operations.
 *
 *  @note This API does not provide large power savings.
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_disablePower(RTC_Regs *rtc_common)
{
    rtc_common->GPRCM.PWREN =
        (RTC_PWREN_KEY_UNLOCK_W | RTC_PWREN_ENABLE_DISABLE);
}

/**
 * @brief Returns if the Peripheral Write Enable (PWREN) register for the RTC
 *        is enabled
 *
 *  Before any peripheral registers can be configured by software, the
 *  peripheral itself must be enabled by writing the ENABLE bit together with
 *  the appropriate KEY value to the peripheral's PWREN register.
 *
 *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
 *  accessible for read/write operations.
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 * @return true if peripheral register access is enabled
 * @return false if peripheral register access is disabled
 */
__STATIC_INLINE bool DL_RTC_Common_isPowerEnabled(const RTC_Regs *rtc_common)
{
    return ((rtc_common->GPRCM.PWREN & RTC_PWREN_ENABLE_MASK) ==
            RTC_PWREN_ENABLE_ENABLE);
}

/**
 *  @brief      Resets all registers in the RTC Common module.
 *
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_reset(RTC_Regs *rtc_common)
{
    rtc_common->GPRCM.RSTCTL =
        (RTC_RSTCTL_KEY_UNLOCK_W | RTC_RSTCTL_RESETSTKYCLR_CLR |
            RTC_RSTCTL_RESETASSERT_ASSERT);
}

/**
 *  @brief      Returns if the RTC Common module was reset
 *
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return true if module was reset
 *  @return false if module was not reset
 */
__STATIC_INLINE bool DL_RTC_Common_isReset(const RTC_Regs *rtc_common)
{
    return ((rtc_common->GPRCM.STAT & RTC_STAT_RESETSTKY_MASK) ==
            RTC_STAT_RESETSTKY_RESET);
}

/**
 *  @brief      Enables interrupts when the CPU is in debug mode. Interrupt
 *              requests are signaled to the interrupt controller.
 *
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_enableDebugInterrupts(RTC_Regs *rtc_common)
{
    rtc_common->DBGCTL |= RTC_DBGCTL_DBGINT_ON;
}

/**
 *  @brief      Disables interrupts when the CPU is in debug mode. Interrupts
 *              of the RTC Common module will not be captured. There will be no
 *              updates to the RTCRIS, RTCMISC and RTCIIDX registers.
 *
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_disableDebugInterrupts(RTC_Regs *rtc_common)
{
    rtc_common->DBGCTL &= ~(RTC_DBGCTL_DBGINT_MASK);
}

/**
 *  @brief      Enables the RTC Common modules debug mode.
 *
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_enableDebugMode(RTC_Regs *rtc_common)
{
    rtc_common->DBGCTL |= RTC_DBGCTL_DBGRUN_RUN;
}

/**
 *  @brief      Disables the RTC Common modules debug mode.
 *
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_disableDebugMode(RTC_Regs *rtc_common)
{
    rtc_common->DBGCTL &= ~(RTC_DBGCTL_DBGRUN_MASK);
}

/**
 *  @brief      Set the format of the real-time clock
 *
 * The format must be selected before the time is set.
 *
 *  @param[in]  rtc_common     Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  formatSelect    Selectable format the RTC Common peripheral will
 *                              provide time in. One of @ref DL_RTC_COMMON_FORMAT
 */
__STATIC_INLINE void DL_RTC_Common_setClockFormat(
    RTC_Regs *rtc_common, DL_RTC_COMMON_FORMAT formatSelect)
{
    rtc_common->CTL |= (uint32_t) formatSelect;
}

/**
 *  @brief      Get the format currently being used for counting the
 *              real-time clock.
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            Format for counting the real-time clock.
 *
 *  @retval            One of @ref DL_RTC_COMMON_FORMAT
 */
__STATIC_INLINE DL_RTC_COMMON_FORMAT DL_RTC_Common_getClockFormat(
    const RTC_Regs *rtc_common)
{
    uint32_t format = (rtc_common->CTL & RTC_CTL_RTCBCD_MASK);

    return (DL_RTC_COMMON_FORMAT)(format);
}

/**
 *  @brief      Sets the interval alarm event condition
 *
 * The interval alarm can be configured to generate an interval alarm event
 * when one of the following events occurs:
 * - MIN changes
 * - HOUR changes
 * - Every day at midnight (00:00:00)
 * - Every day at noon (12:00:00)
 *
 * The interval alarm sources the @ref DL_RTC_COMMON_INTERRUPT_INTERVAL_ALARM interrupt
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  alarmEvent  The interval alarm interrupt condition. One of
 *                          @ref DL_RTC_COMMON_INTERVAL_ALARM
 */
__STATIC_INLINE void DL_RTC_Common_setIntervalAlarm(
    RTC_Regs *rtc_common, DL_RTC_COMMON_INTERVAL_ALARM alarmEvent)
{
    DL_Common_updateReg(
        &rtc_common->CTL, (uint32_t) alarmEvent, RTC_CTL_RTCTEVTX_MASK);
}

/**
 *  @brief      Gets the interval alarm event condition
 *
 * The interval alarm can be configured to generate an interval alarm event
 * when one of the following events occurs:
 * - MIN changes
 * - HOUR changes
 * - Every day at midnight (00:00:00)
 * - Every day at noon (12:00:00)
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return DL_RTC_COMMON_INTERVAL_ALARM
 */
__STATIC_INLINE DL_RTC_COMMON_INTERVAL_ALARM DL_RTC_Common_getIntervalAlarm(
    const RTC_Regs *rtc_common)
{
    uint32_t alarm = (rtc_common->CTL & RTC_CTL_RTCTEVTX_MASK);

