TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_rtc_common.h
/**
 *  @brief      Enable minutes in BCD for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_enableAlarm2MinutesBCD(RTC_Regs *rtc_common)
{
    rtc_common->A2MIN |= RTC_A2MIN_AMINAEBCD_ENABLE;
}

/**
 *  @brief      Disable minutes in BCD for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_disableAlarm2MinutesBCD(
    RTC_Regs *rtc_common)
{
    rtc_common->A2MIN &= ~(RTC_A2MIN_AMINAEBCD_MASK);
}

/**
 *  @brief      Set the minutes in BCD for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common      Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  minutes    Value for the minutes of alarm 2
 *                         Valid values are 0x0-0x59
 *
 */
__STATIC_INLINE void DL_RTC_Common_setAlarm2MinutesBCD(
    RTC_Regs *rtc_common, uint8_t minutes)
{
    rtc_common->A2MIN =
        ((uint32_t) minutes << RTC_A2MIN_AMINLOWBCD_OFS) &
        (RTC_A2MIN_AMINLOWBCD_MASK | RTC_A2MIN_AMINHIGHBCD_MASK);
}

/**
 *  @brief      Get the minutes in BCD for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            The minutes of alarm 2
 *
 *  @retval            Value in range: 0x0-0x59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getAlarm2MinutesBCD(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)((rtc_common->A2MIN & (RTC_A2MIN_AMINLOWBCD_MASK |
                                              RTC_A2MIN_AMINHIGHBCD_MASK)) >>
                     RTC_A2MIN_AMINLOWBCD_OFS);
}

/**
 *  @brief      Enable hours in BCD for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_enableAlarm2HoursBCD(RTC_Regs *rtc_common)
{
    rtc_common->A2HOUR |= RTC_A2HOUR_AHOURAEBIN_ENABLE;
}

/**
 *  @brief      Disable hours in BCD for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_disableAlarm2HoursBCD(RTC_Regs *rtc_common)
{
    rtc_common->A2HOUR &= ~(RTC_A2HOUR_AHOURAEBIN_MASK);
}

/**
 *  @brief      Set the hours in BCD for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  hours    Value for the hours of alarm 2
 *                       Valid values are 0x0-0x23
 */
__STATIC_INLINE void DL_RTC_Common_setAlarm2HoursBCD(
    RTC_Regs *rtc_common, uint8_t hours)
{
    rtc_common->A2HOUR =
        ((uint32_t) hours << RTC_A2HOUR_AHOURLOWBCD_OFS) &
        (RTC_A2HOUR_AHOURLOWBCD_MASK | RTC_A2HOUR_AHOURHIGHBCD_MASK);
}

/**
 *  @brief      Get the hours in BCD for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            The hours of alarm 2
 *
 *  @retval            Value in range: 0x0-0x23
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getAlarm2HoursBCD(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(
        (rtc_common->A2HOUR &
            (RTC_A2HOUR_AHOURLOWBCD_MASK | RTC_A2HOUR_AHOURHIGHBCD_MASK)) >>
        RTC_A2HOUR_AHOURLOWBCD_OFS);
}

/**
 *  @brief      Enable day of the week in BCD for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_enableAlarm2DayOfWeekBCD(
    RTC_Regs *rtc_common)
{
    rtc_common->A2DAY |= RTC_A2DAY_ADOWAE_ENABLE;
}

/**
 *  @brief      Disable day of the week in BCD for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_disableAlarm2DayOfWeekBCD(
    RTC_Regs *rtc_common)
{
    rtc_common->A2DAY &= ~(RTC_A2DAY_ADOWAE_MASK);
}

/**
 *  @brief      Set the day of the week in BCD for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  day    Value for the day of the week of the RTC Common calendar
 *                     Valid values are 0x0-0x6
 */
__STATIC_INLINE void DL_RTC_Common_setAlarm2DayOfWeekBCD(
    RTC_Regs *rtc_common, uint8_t day)
{
    DL_Common_updateReg(&rtc_common->A2DAY, day, RTC_A2DAY_ADOW_MASK);
}

/**
 *  @brief      Get the day of the week in BCD for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            The day of the week in the RTC Common calendar
 *
 *  @retval            Value in range: 0x0-0x6
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getAlarm2DayOfWeekBCD(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->DAY & RTC_A2DAY_ADOW_MASK);
}

/**
 *  @brief      Enable day of the month in BCD for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_enableAlarm2DayOfMonthBCD(
    RTC_Regs *rtc_common)
{
    rtc_common->A2DAY |= RTC_A2DAY_ADOMAEBCD_ENABLE;
}

/**
 *  @brief      Disable day of the month in BCD for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_disableAlarm2DayOfMonthBCD(
    RTC_Regs *rtc_common)
{
    rtc_common->A2DAY &= ~(RTC_A2DAY_ADOMAEBCD_MASK);
}

/**
 *  @brief      Set the day of the month in BCD for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  day    Value for the day of the month of the RTC Common calendar
 *                     Valid values are 0x1-0x31
 */
__STATIC_INLINE void DL_RTC_Common_setAlarm2DayOfMonthBCD(
    RTC_Regs *rtc_common, uint8_t day)
{
    DL_Common_updateReg(&rtc_common->A2DAY,
        (uint32_t) day << RTC_A2DAY_ADOMLOWBCD_OFS,
        (RTC_A2DAY_ADOMLOWBCD_MASK | RTC_A2DAY_ADOMHIGHBCD_MASK));
}

/**
 *  @brief      Get the day of the month in BCD for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            The day of the month in the RTC Common calendar
 *
 *  @retval            Value in range: 0x1-0x31
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getAlarm2DayOfMonthBCD(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)((rtc_common->A2DAY & (RTC_A2DAY_ADOMLOWBCD_MASK |
                                              RTC_A2DAY_ADOMHIGHBCD_MASK)) >>
                     RTC_A2DAY_ADOMLOWBCD_OFS);
}

/**
 *  @brief      Set the seconds in binary the RTC Common calendar
 *
 *  @param[in]  rtc_common      Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  seconds    Value for the seconds of the RTC Common calendar
 *                         Valid values are 0-59
 */
__STATIC_INLINE void DL_RTC_Common_setCalendarSecondsBinary(
    RTC_Regs *rtc_common, uint8_t seconds)
{
    rtc_common->SEC = (seconds & RTC_SEC_SECBIN_MASK);
}

/**
 *  @brief      Get the seconds in binary in the RTC Common calendar
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The seconds in the RTC Common calendar
 *
 *  @retval            Value in range: 0-59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getCalendarSecondsBinary(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->SEC & RTC_SEC_SECBIN_MASK);
}

/**
 *  @brief      Set the minutes in binary in the RTC Common calendar
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  minutes    Value for the minutes of the RTC Common calendar
 *                         Valid values are 0-59
 */
__STATIC_INLINE void DL_RTC_Common_setCalendarMinutesBinary(
    RTC_Regs *rtc_common, uint8_t minutes)
{
    rtc_common->MIN = (minutes & RTC_MIN_MINBIN_MASK);
}

/**
 *  @brief      Get the minutes in binary in the RTC Common calendar
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The minutes in the RTC Common calendar
 *
 *  @retval            Value in range: 0-59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getCalendarMinutesBinary(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->MIN & RTC_MIN_MINBIN_MASK);
}

/**
 *  @brief      Set the hours in binary in the RTC Common calendar
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  hours    Value for the hours of the RTC Common calendar
 *                       Valid values are 0-23
 */
__STATIC_INLINE void DL_RTC_Common_setCalendarHoursBinary(
    RTC_Regs *rtc_common, uint8_t hours)
{
    rtc_common->HOUR = (hours & RTC_HOUR_HOURBIN_MASK);
}

/**
 *  @brief      Get the hours in binary in the RTC Common calendar
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The hours in the RTC Common calendar
 *
 *  @retval            Value in range: 0-23
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getCalendarHoursBinary(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->HOUR & RTC_HOUR_HOURBIN_MASK);
}

/**
 *  @brief      Set the day of the week in binary in the RTC Common calendar
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  day    Value for the day of the week of the RTC Common calendar
 *                     Valid values are 0-6
 */
__STATIC_INLINE void DL_RTC_Common_setCalendarDayOfWeekBinary(
    RTC_Regs *rtc_common, uint8_t day)
{
    DL_Common_updateReg(&rtc_common->DAY, day, RTC_DAY_DOW_MASK);
}

/**
 *  @brief      Get the day of the week in binary in the RTC Common calendar
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The day of the week in the RTC Common calendar
 *
 *  @retval            Value in range: 0-6
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getCalendarDayOfWeekBinary(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->DAY & RTC_DAY_DOW_MASK);
}

/**
 *  @brief      Set the day of the month in binary in the RTC Common calendar
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  day    Value for the day of the month of the RTC Common calendar
 *                     Valid values are 1-31
 */
__STATIC_INLINE void DL_RTC_Common_setCalendarDayOfMonthBinary(
    RTC_Regs *rtc_common, uint8_t day)
{
    DL_Common_updateReg(&rtc_common->DAY, (uint32_t) day << RTC_DAY_DOMBIN_OFS,
        RTC_DAY_DOMBIN_MASK);
}

/**
 *  @brief      Get the day of the month in binary in the RTC Common calendar
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The day of the month in the RTC Common calendar
 *
 *  @retval            Value in range: 1-31
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getCalendarDayOfMonthBinary(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(
        (rtc_common->DAY & RTC_DAY_DOMBIN_MASK) >> RTC_DAY_DOMBIN_OFS);
}

/**
 *  @brief      Set the month in binary in the RTC Common calendar
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  month    Value for the month of the RTC Common calendar
 *                       Valid values are 1-12
 */
__STATIC_INLINE void DL_RTC_Common_setCalendarMonthBinary(
    RTC_Regs *rtc_common, uint8_t month)
{
    rtc_common->MON = (month & RTC_MON_MONBIN_MASK);
}

/**
 *  @brief      Get the month of the year in binary in the RTC Common calendar
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The month of the year in the RTC Common calendar
 *
 *  @retval            Value in range: 1-12
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getCalendarMonthBinary(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->MON & RTC_MON_MONBIN_MASK);
}

/**
 *  @brief      Set the year in binary in the RTC Common calendar
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  year    Value for the year of the RTC Common calendar
 *                      Valid values are 0-4095
 */
__STATIC_INLINE void DL_RTC_Common_setCalendarYearBinary(
    RTC_Regs *rtc_common, uint16_t year)
{
    rtc_common->YEAR = ((uint32_t) year & (RTC_YEAR_YEARLOWBIN_MASK |
                                              RTC_YEAR_YEARHIGHBIN_MASK));
}

/**
 *  @brief      Get the year in binary in the RTC Common calendar
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The year in the RTC Common calendar
 *
 *  @retval            Value in range: 0-4095
 *
 */
__STATIC_INLINE uint16_t DL_RTC_Common_getCalendarYearBinary(
    const RTC_Regs *rtc_common)
{
    return (uint16_t)(rtc_common->YEAR &
                      (RTC_YEAR_YEARLOWBIN_MASK | RTC_YEAR_YEARHIGHBIN_MASK));
}

/**
 *  @brief      Enable minutes in binary in binary for RTC Common Calendar Alarm 1
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_enableAlarm1MinutesBinary(
    RTC_Regs *rtc_common)
{
    rtc_common->A1MIN |= RTC_A1MIN_AMINAEBIN_ENABLE;
}

/**
 *  @brief      Disable minutes in binary for RTC Common Calendar Alarm 1
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_disableAlarm1MinutesBinary(
    RTC_Regs *rtc_common)
{
    rtc_common->A1MIN &= ~(RTC_A1MIN_AMINAEBIN_MASK);
}

/**
 *  @brief      Set the minutes in binary for RTC Common Calendar Alarm 1
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  minutes    Value for the minutes of alarm 1
 *                         Valid values are 0-59
 *
 */
__STATIC_INLINE void DL_RTC_Common_setAlarm1MinutesBinary(
    RTC_Regs *rtc_common, uint8_t minutes)
{
    rtc_common->A1MIN = (minutes & RTC_A1MIN_AMINBIN_MASK);
}

/**
 *  @brief      Get the minutes in binary for RTC Common Calendar Alarm 1
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            The minutes of alarm 1
 *
 *  @retval            Value in range: 0-59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getAlarm1MinutesBinary(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->A1MIN & RTC_A1MIN_AMINBIN_MASK);
}

/**
 *  @brief      Enable hours in binary for RTC Common Calendar Alarm 1
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_enableAlarm1HoursBinary(
    RTC_Regs *rtc_common)
{
    rtc_common->A1HOUR |= RTC_A1HOUR_AHOURAEBIN_ENABLE;
}

/**
 *  @brief      Disable hours in binary for RTC Common Calendar Alarm 1
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_disableAlarm1HoursBinary(
    RTC_Regs *rtc_common)
{
    rtc_common->A1HOUR &= ~(RTC_A1HOUR_AHOURAEBIN_MASK);
}

/**
 *  @brief      Set the hours in binary for RTC Common Calendar Alarm 1
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  hours    Value for the hours of alarm 1
 *                       Valid values are 0-23
 */
__STATIC_INLINE void DL_RTC_Common_setAlarm1HoursBinary(
    RTC_Regs *rtc_common, uint8_t hours)
{
    rtc_common->A1HOUR = (hours & RTC_A1HOUR_AHOURBIN_MASK);
}

/**
 *  @brief      Get the hours in binary for RTC Common Calendar Alarm 1
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            The hours of alarm 1
 *
 *  @retval            Value in range: 0-23
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getAlarm1HoursBinary(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->A1HOUR & RTC_A1HOUR_AHOURBIN_MASK);
}

/**
 *  @brief      Enable day of the week in binary for RTC Common Calendar Alarm 1
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_enableAlarm1DayOfWeekBinary(
    RTC_Regs *rtc_common)
{
    rtc_common->A1DAY |= RTC_A1DAY_ADOWAE_ENABLE;
}

/**
 *  @brief      Disable day of the week in binary for RTC Common Calendar Alarm 1
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_disableAlarm1DayOfWeekBinary(
    RTC_Regs *rtc_common)
{
    rtc_common->A1DAY &= ~(RTC_A1DAY_ADOWAE_MASK);
}

/**
 *  @brief      Set the day of the week in binary for RTC Common Calendar Alarm 1
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  day    Value for the day of the week of the RTC Common calendar
 *                     Valid values are 0-6
 */
__STATIC_INLINE void DL_RTC_Common_setAlarm1DayOfWeekBinary(
    RTC_Regs *rtc_common, uint8_t day)
{
    DL_Common_updateReg(&rtc_common->A1DAY, day, RTC_A1DAY_ADOW_MASK);
}

/**
 *  @brief      Get the day of the week in binary for RTC Common Calendar Alarm 1
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            The day of the week in the RTC Common calendar
 *
 *  @retval            Value in range: 0-6
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getAlarm1DayOfWeekBinary(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->A1DAY & RTC_A1DAY_ADOW_MASK);
}

/**
 *  @brief      Enable day of the month in binary for RTC Common Calendar Alarm 1
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_enableAlarm1DayOfMonthBinary(
    RTC_Regs *rtc_common)
{
    rtc_common->A1DAY |= RTC_A1DAY_ADOMAEBIN_ENABLE;
}

/**
 *  @brief      Disable day of the month in binary for RTC Common Calendar Alarm 1
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_disableAlarm1DayOfMonthBinary(
    RTC_Regs *rtc_common)
{
    rtc_common->A1DAY &= ~(RTC_A1DAY_ADOMAEBIN_MASK);
}

/**
 *  @brief      Set the day of the month in binary for RTC Common Calendar Alarm 1
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  day    Value for the day of the month of the RTC Common calendar
 *                     Valid values are 1-31
 */
__STATIC_INLINE void DL_RTC_Common_setAlarm1DayOfMonthBinary(
    RTC_Regs *rtc_common, uint8_t day)
{
    DL_Common_updateReg(&rtc_common->A1DAY,
        (uint32_t) day << RTC_A1DAY_ADOMBIN_OFS, RTC_A1DAY_ADOMBIN_MASK);
}

/**
 *  @brief      Get the day of the month in binary for RTC Common Calendar Alarm 1
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            The day of the month in the RTC Common calendar
 *
 *  @retval            Value in range: 1-31
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getAlarm1DayOfMonthBinary(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(
        (rtc_common->A1DAY & RTC_A1DAY_ADOMBIN_MASK) >> RTC_A1DAY_ADOMBIN_OFS);
}

/**
 *  @brief      Enable minutes in binary for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_enableAlarm2MinutesBinary(
    RTC_Regs *rtc_common)
{
    rtc_common->A2MIN |= RTC_A2MIN_AMINAEBIN_ENABLE;
}

/**
 *  @brief      Disable minutes in binary for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_disableAlarm2MinutesBinary(
    RTC_Regs *rtc_common)
{
    rtc_common->A2MIN &= ~(RTC_A2MIN_AMINAEBIN_MASK);
}

/**
 *  @brief      Set the minutes in binary for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  minutes    Value for the minutes of alarm 2
 *                         Valid values are 0-59
 *
 */
__STATIC_INLINE void DL_RTC_Common_setAlarm2MinutesBinary(
    RTC_Regs *rtc_common, uint8_t minutes)
{
    rtc_common->A2MIN = (minutes & RTC_A2MIN_AMINBIN_MASK);
}

/**
 *  @brief      Get the minutes in binary for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            The minutes of alarm 2
 *
 *  @retval            Value in range: 0-59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getAlarm2MinutesBinary(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->A2MIN & RTC_A2MIN_AMINBIN_MASK);
}

/**
 *  @brief      Enable hours in binary for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_enableAlarm2HoursBinary(
    RTC_Regs *rtc_common)
{
    rtc_common->A2HOUR |= RTC_A2HOUR_AHOURAEBIN_ENABLE;
}

/**
 *  @brief      Disable hours in binary for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_disableAlarm2HoursBinary(
    RTC_Regs *rtc_common)
{
    rtc_common->A2HOUR &= ~(RTC_A2HOUR_AHOURAEBIN_MASK);
}

/**
 *  @brief      Set the hours in binary for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  hours    Value for the hours of alarm 2
 *                       Valid values are 0-23
 */
__STATIC_INLINE void DL_RTC_Common_setAlarm2HoursBinary(
    RTC_Regs *rtc_common, uint8_t hours)
{
    rtc_common->A2HOUR = (hours & RTC_A2HOUR_AHOURBIN_MASK);
}

